## Plan for aft/main
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_iam_policy.aft_vault_cleanup`                                      |
|        | `aws_iam_role_policy_attachment.assume_aft_vault_cleanup_role`          |
|        | `module.gh_oidc_roles.aws_iam_role.this[&quot;aft-vault-cleanup-resources&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.aft_vault_cleanup will be created
  + resource "aws_iam_policy" "aft_vault_cleanup" {
      + arn         = (known after apply)
      + description = "Policy to allow the aft vault cleanup script to run"
      + id          = (known after apply)
      + name        = "aft-vault-cleanup-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "backup:ListRecoveryPointsByBackupVault",
                          + "backup:DeleteRecoveryPoint",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:backup:ca-central-1:137554749751:recovery-point:*",
                          + "arn:aws:backup:ca-central-1:137554749751:backup-vault:aft-controltower-backup-vault",
                        ]
                      + Sid      = "AllowDeleteRecoveryPoints"
                    },
                  + {
                      + Action   = [
                          + "config:StopConfigurationRecorder",
                          + "config:StartConfigurationRecorder",
                          + "config:DescribeConfigurationRecorders",
                          + "config:DescribeConfigurationRecorderStatus",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowToggleConfigRecorder"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_aft_vault_cleanup_role will be created
  + resource "aws_iam_role_policy_attachment" "assume_aft_vault_cleanup_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aft-vault-cleanup-resources"
    }

  # module.gh_oidc_roles.aws_iam_role.this["aft-vault-cleanup-resources"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = [
                                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::137554749751:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-vault-cleanup-resources"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aft_vault_cleanup"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_slack_notification.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_slack_notification.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_slack_notification.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_slack_notification.aws_lambda_function.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy_assume.aws_iam_policy.this"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
